cases/ZPG-flatPlate/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 8675; // 8675=125*69.4/1 ; // 0.011;

boundaryField
{
    inlet
    {
        type            fixedValue;

//        type            turbulentMixingLengthFrequencyInlet;
//        mixingLength    1;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    topWall
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            omegaWallFunction;
        blended         true;
        value           $internalField;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
